In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv('Bengaluru_House_Data.csv',delimiter=',',sep=r', ')

In [3]:
data.shape

(13320, 9)

In [4]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
for columns in data.columns:
    print(data[columns].value_counts())
    print('--'*25)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
--------------------------------------------------
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
17-Jan               1
16-Jan               1
15-Aug               1
14-Jul               1
15-Dec               1
Name: availability, Length: 81, dtype: int64
--------------------------------------------------
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
Lalbagh Road                         1
poornaprajna layout                  1
Subramanyanagar                      1
Kengeri Satellite Town Stage II      1
Tharabanahalli                       1
Name: location, Length: 1305, dtype: int64
--------------------------------------------------
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
18 Bedroom       1
27 BHK           1
43 Bedroom       1
19 BHK           1
16 BHK           1
12 Bedroom       1
13 BHK           1
14 BHK           1
Name: size, dtype: int64
--------------------------------------------------
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Leuseut     1
MDoseim     1
Foncync     1
Haaceal     1
Keersto     1
Name: society, Length: 2688, dtype: int64
--------------------------------------------------
1200           843
1100           221
1500           205
2400           196
600            180
              ...
3Cents           1
1410 - 1710      1
351              1
1766             1
3092             1
Name: total_sqft, Length: 2117, dtype: int64
--------------------------------------------------
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64
--------------------------------------------------
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
--------------------------------------------------
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
81.55      1
69.49      1
42.18      1
70.25      1
74.82      1
Name: price, Length: 1994, dtype: int64
--------------------------------------------------

In [7]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [8]:
data.drop(['area_type','availability','society','balcony'],axis=1,inplace=True)

In [9]:
data.shape

(13320, 5)

In [10]:
data.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [11]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [13]:
data['location'].value_counts()

Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
Lalbagh Road                         1
poornaprajna layout                  1
Subramanyanagar                      1
Kengeri Satellite Town Stage II      1
Tharabanahalli                       1
Name: location, Length: 1305, dtype: int64

In [14]:
data['location']=data['location'].fillna('Sarjapur Road')

In [15]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
18 Bedroom       1
27 BHK           1
43 Bedroom       1
19 BHK           1
16 BHK           1
12 Bedroom       1
13 BHK           1
14 BHK           1
Name: size, dtype: int64

In [16]:
data['size']=data['size'].fillna('2 BHK')

In [17]:
data['bath']=data['bath'].fillna(data['bath'].median())

In [18]:
data.isna().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [20]:
data['bhk']=data['size'].str.split().str.get(0).astype(int)

In [21]:
# outliers
data[data['bhk']>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [22]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [23]:
def convert_range(x):
    temp=x.split('-')
    if len(temp)==2:
        return (float(temp[0])+float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [24]:
data['total_sqft']=data['total_sqft'].apply(convert_range)

In [25]:
data.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

#### Price Per Square Feet

In [26]:
data['Price_per_sqft']= data['price']*100000 / data['total_sqft']

In [27]:
data['Price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: Price_per_sqft, Length: 13320, dtype: float64

In [28]:
data.describe()

         total_sqft          bath         price           bhk  Price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [29]:
data['location'].value_counts()

Whitefield             540
Sarjapur  Road         399
Electronic City        302
Kanakpura Road         273
Thanisandra            234
                      ...
poornaprajna layout      1
BAGUR                    1
Kanakapura Road,         1
Subramanyanagar          1
Lalbagh Road             1
Name: location, Length: 1306, dtype: int64

In [30]:
data['location']=data['location'].apply(lambda x:x.strip())
location_counts=data['location'].value_counts()

In [31]:
location_counts

Whitefield                        541
Sarjapur  Road                    399
Electronic City                   304
Kanakpura Road                    273
Thanisandra                       237
                                 ...
Arekempanahalli                     1
Mango Garden Layout                 1
Viviani Road                        1
Nanjappa Layout Vidyaranyapura      1
Panathur Road,                      1
Name: location, Length: 1295, dtype: int64

In [32]:
location_counts_less_10=location_counts[location_counts<10]
data['location']=data['location'].apply(lambda x: 'other' if x in location_counts_less_10 else x)

In [33]:
data['location'].value_counts()

other                   2756
Whitefield               541
Sarjapur  Road           399
Electronic City          304
Kanakpura Road           273
                        ...
Nagappa Reddy Layout      10
Sadashiva Nagar           10
Ganga Nagar               10
BTM 1st Stage             10
Naganathapura             10
Name: location, Length: 255, dtype: int64

#### Outlier Detection and Removal

In [34]:
data.describe()

         total_sqft          bath         price           bhk  Price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [35]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [36]:
data=data[(data['total_sqft']/data['bhk'])>=300]

In [37]:
data.describe()

         total_sqft          bath         price           bhk  Price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838     6303.979357
std     1261.271296      1.077938    152.077329      0.976678     4162.237981
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [38]:
data.shape

(12530, 7)

In [39]:
data['Price_per_sqft'].describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: Price_per_sqft, dtype: float64

In [40]:
def remove_outlier_sqrt(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.Price_per_sqft)
        st=np.std(subdf.Price_per_sqft)
        
        gen_df=subdf[(subdf.Price_per_sqft > (m-st)) & (subdf.Price_per_sqft <=(m+st))]
        df_output = pd.concat([df_output, gen_df],ignore_index=True)
    return df_output

data=remove_outlier_sqrt(data)
data.describe()

         total_sqft          bath         price           bhk  Price_per_sqft
count  10282.000000  10282.000000  10282.000000  10282.000000    10282.000000
mean    1509.996956      2.474032     91.718675      2.576347     5669.007067
std      883.210082      0.986908     88.327858      0.900592     2292.794131
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1110.000000      2.000000     49.000000      2.000000     4249.917219
50%     1286.000000      2.000000     67.000000      2.000000     5176.565008
75%     1650.000000      3.000000    100.000000      3.000000     6431.808627
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [41]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.Price_per_sqft),
                'std': np.std(bhk_df.Price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.Price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [42]:
data=bhk_outlier_remover(data)

In [43]:
data.shape

(7402, 7)

In [44]:
data.drop(['size','Price_per_sqft'],axis=1,inplace=True)

#### Cleaned Data

In [45]:
data.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [46]:
data.to_csv('Cleaned_data.csv')

In [47]:
X=data.drop('price',axis=1)
y=data['price']

In [48]:
data['bath'] = data['bath'].astype('float')
data['bhk'] = data['bhk'].astype('float')

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7402 entries, 0 to 10281
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    7402 non-null   object
 1   total_sqft  7402 non-null   float64
 2   bath        7402 non-null   float64
 3   price       7402 non-null   float64
 4   bhk         7402 non-null   float64
dtypes: float64(4), object(1)
memory usage: 347.0+ KB

In [50]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge,SGDRegressor
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [51]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [52]:
print(X_train.shape)
print(X_test.shape)

(5921, 4)
(1481, 4)

#### Linear Regression

In [53]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')

In [54]:
scaler=StandardScaler()

In [55]:
lr = LinearRegression()

In [56]:
pipe = make_pipeline(column_trans, scaler, lr)

In [57]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression())])

In [58]:
y_pred_lr= pipe.predict(X_test)

In [59]:
r2_score(y_test,y_pred_lr)

0.8948892812635066

#### Lasso

In [60]:
lasso=Lasso()

In [61]:
pipe=make_pipeline(column_trans,scaler,lasso)

In [62]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [63]:
y_pred_lasso=pipe.predict(X_test)
r2_score(y_test,y_pred_lasso)

0.8791024957509113

#### Ridge

In [64]:
ridge=Ridge()

In [65]:
pipe = make_pipeline(column_trans, scaler, ridge)

In [66]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [67]:
y_pred_ridge=pipe.predict(X_test)
r2_score(y_test,y_pred_ridge)

0.8948686298478502

In [68]:
print('No Regularization : ', r2_score(y_test, y_pred_lr))
print('Lasso : ', r2_score(y_test, y_pred_lasso))
print('Ridge : ', r2_score(y_test, y_pred_ridge))

No Regularization :  0.8948892812635066
Lasso :  0.8791024957509113
Ridge :  0.8948686298478502

In [69]:
import pickle

In [70]:
pickle.dump(pipe,open('RidgeModel.pk','wb'))